CSI API ETABS v1
cDetailing.GetSimilarColumnStacks Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetSimilarColumnStacks(
	string ColumnStackID,
	ref int NumberSimilarColumns,
	ref int[] NumberUniqueObjects,
	ref string[] ObjectUniqueNames
)
Function GetSimilarColumnStacks (
	ColumnStackID As String,
	ByRef NumberSimilarColumns As Integer,
	ByRef NumberUniqueObjects As Integer(),
	ByRef ObjectUniqueNames As String()
) As Integer
Dim instance As cDetailing
Dim ColumnStackID As String
Dim NumberSimilarColumns As Integer
Dim NumberUniqueObjects As Integer()
Dim ObjectUniqueNames As String()
Dim returnValue As Integer
returnValue = instance.GetSimilarColumnStacks(ColumnStackID,
	NumberSimilarColumns, NumberUniqueObjects,
	ObjectUniqueNames)
int GetSimilarColumnStacks(
	String^ ColumnStackID,
	int% NumberSimilarColumns,
	array<int>^% NumberUniqueObjects,
	array<String^>^% ObjectUniqueNames
)
abstract GetSimilarColumnStacks :
        ColumnStackID : string *
        NumberSimilarColumns : int byref *
        NumberUniqueObjects : int[] byref *
        ObjectUniqueNames : string[] byref -> int
Parameters
ColumnStackID
Type: System.String
NumberSimilarColumns
Type: System.Int32
NumberUniqueObjects
Type: System.Int32[]
ObjectUniqueNames
Type: System.String[]
Return Value
Type: Int32
See Also
Reference
cDetailing Interface
ETABSv1 Namespace